[M_Orchid_PlotMission08 MissionDefinition]
MissionName="it must be clear"
MissionDescription="Now that you've got all the parts for Captain Blade's computer, there's only one thing left to do: bring the measuring tool you made. [place]Magnus Lighthouse[-place]. Scarlett said you can tell where the grains of sand are with an optical microscope. Then do it. Which is true."
TurnInDescription="The location of the missing property has been announced. Now let's follow.!"
MissionSummary="Take Captain Blade's computer to Magnus Lighthouse.."
MissionGiver="Captain Scarlett"
MissionTurnInLocation="bright light house"
TeaserText=""

[M_Orchid_PlotMission08:ActivateBeacon MissionObjectiveDefinition]
ProgressMessage="turned into a backpack"

[M_Orchid_PlotMission08:ActivateBeaconSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:ActivateBeaconSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:Activatelift MissionObjectiveDefinition]
ProgressMessage="Turn on the elevator"

[M_Orchid_PlotMission08:ActivateLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:AssembleCompass MissionObjectiveDefinition]
ProgressMessage="Return Captain Blade's compass."

[M_Orchid_PlotMission08:AssembleCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:Dummy MissionObjectiveDefinition]
ProgressMessage=""

[M_Orchid_PlotMission08:DummySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:FindWayUp MissionObjectiveDefinition]
ProgressMessage="Find your way"

[M_Orchid_PlotMission08:FindWayUpSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:GotoLighthouse MissionObjectiveDefinition]
ProgressMessage="Entering Castle Magnes"

[M_Orchid_PlotMission08:GotoLighthouseSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:GotoLighthouseSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:GotoSpireSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:InsertCompass MissionObjectiveDefinition]
ProgressMessage="Enter the compass."

[M_Orchid_PlotMission08:InsertCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:Opengate MissionObjectiveDefinition]
ProgressMessage="Open door"

[M_Orchid_PlotMission08:OpenGateSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:TakeCompass MissionObjectiveDefinition]
ProgressMessage="Prepare the compass."

[M_Orchid_PlotMission08:TakeCompassPiece MissionObjectiveDefinition]
ProgressMessage="Get a red compass."

[M_Orchid_PlotMission08:TakeCompassPieceSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:TakeCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:UseLift MissionObjectiveDefinition]
ProgressMessage="Take the elevator"

[M_Orchid_PlotMission08:UseLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:WaitForLift MissionObjectiveDefinition]
ProgressMessage="Wait for the elevator"

[M_Orchid_PlotMission08:WaitForLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

